[
    {
        "date": "07/18/2023",
        "title": "new tutorial!",
        "body": "minor bug fixes around the site's css and ts.</p><p>check out the new article <a href='/tips.html?c=css&a=1'>here!</a>",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/f1734674748a2ead3112c696caa95e8afc54ab15",
        "id": 5,
        "isMajor": false
    },
    {
        "date": "07/15/2023",
        "title": "double click chicken flip",
        "body": "desktop only: double clicking on a free-floating image flips it horizontally. try that <a href='/about.html'>here</a>! this is HUGE.",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/791bee6e1b0035161cbf6af5135c0a2d3e312057",
        "id": 4,
        "isMajor": true
    },
    {
        "date": "07/15/2023",
        "title": "css polish, links",
        "body": "fixed my css for desktop AND mobile. took the time to learn what i was actually doing!</p><p class='whisper'>oh and now this changelog page will automatically open an update based on the hash. [<a href='#0'>try that here.</a>], finally added a couple of links, more to come [<a href='/links.html'>here</a>], and now certain windows will randomly scatter themselves across the page on desktop..... good luck. wormboy away!",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/af469f7f21c9be6d8977e7f8294cf4f2615b780b",
        "id": 3,
        "isMajor": false
    },
    {
        "date": "07/14/2023",
        "title": "beginning tutorial page",
        "body": "just BARELY putting this in on the 14th, but anyways...</p><p>added <a href='tips.html'>a tutorial page</a>. currently labelled 'tips' but i'm not sure if i stick to that. i'm not asking for you to tip me, but 'tutorial' sounds to formal. the idea for this page is for me to document things i learn and have a spot to refer my friends to when they have questions. currently there is but one tutorial up, but the bulk of today's work was <span class='silenced'>getting myself to focus on just one page</span> getting the framework in place. worm boy BED TIME!!!",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/2efdc193683aa2fcec3ef3ac963e24d9865c0717",
        "id": 2,
        "isMajor": false
    },
    {
        "date": "07/14/2023",
        "title": "scream!",
        "body": "to get the boring things out of the way... i did a pretty big restructure to the site's file organization! two actually!! but no one cares about that. let's get to the fun stuff:</p><p><a href='./scream.html' class='new'>yell into the void!</a> i'm not sure when i first had the idea for this page, but it didn't take very long to make it a reality. if anyone is out there, let me know what you think of it. it could use some polish regardless, but i may or may not expand on it in the future.</p><p>more soon to come. wormboy out!!!!!!!",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/ea7f5365f11a8717533f8200375a5e3eb69bf24e",
        "id": 1,
        "isMajor": true
    },
    {
        "date": "07/12/2023",
        "title": "added changelog!",
        "body": "i have created the beginnings of a changelog! and a full changelog page! if you are reading this, you are probably on that changelog page and hitting buttons. i have future plans for this little window to be able to close, or maaaybe to prevent duplicates from opening.. but that's not really fun :(</p><p>anyways, i have some work to do with how it displays the changelog list, and how it'll highlight major updates! i have soooooo many other things to be doing but for today, this might be wormboy out!.... byebye!!!!!!</p><p>edit: i added more stuff, beginnings for <a href='./about.html'>about</a> and <a href='./links.html'>links</a>. WORM BOY OUT FORREAL NOW!!!!!", 
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/34331a777097488db948f6a4fdb397a4662056e8",
        "id": 0,
        "isMajor": false
    }
]