[
    {
        "date": "08/26/2023",
        "title": "music api launch!!",
        "body": "it is live! what is? uhhhh</p><p>i made an api that acts as a proxy between people viewing your website and your spotify data. it CANNOT be used by others just yet <span class='whisper'>i need to bring documentation to spotify and get their approval....</span> but it WILL be something available to others. what can you do with this api? click <a>here</a> to find out !!</p><p>um so anyways yeah now my top 5 artists are displayed on my homepage!",
        "gitCommit": "",
        "id": 14,
        "isMajor": true
    },
    {
        "date": "08/20/2023",
        "title": "link page revamped",
        "body": "that's right babey!!!!!!!!! i have been wanting to do this a while, and so while i'm still sorta low energy, here it is: a compilation of links to free games and tools and resources. this page will be frequently updated as i think of and discover new things i'd like to share. but! here is it's starting point.</p><p class='whisper'>note: not merging this with the main branch just yet, as i think i'll rewrite it to be generated like other pages are :]!</p><p>anyways, find that <a href='/links.html'>HERE!!!!!</a>",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/4264b01a18e47547a139d4ea2674ff5fa8a330f4",
        "id": 13,
        "isMajor": true
    },
    {
        "date": "08/11/2023",
        "title": "minor tweaks, progress slowed",
        "body": "guess who has a little bit of burnout ... it is me.</p><p>this is ok though, i will be so brave about it. this update comes with a couple lil touches:<ul><li>visible focus styling for links, buttons, and inputs. <span class='whisper'>ex: when you hit tab and cycle through elements on the page.</span></li><li>another item in the gallery</li><li>different nav structure on the tips page.</li></ul><p>a little disappointed cuz i wanna have more articles written, but it's ok and i forgive myself. bye bye!!!</p><p class='whisper'>ps: now i added meta tags to each page to give it a little theme color for the preview embeds on discord. yay!",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/85cd9281e70267bf0d06b2f88e359d3fb949bf52",
        "id": 12,
        "isMajor": false
    },
    {
        "date": "08/07/2023",
        "title": "opened art gallery",
        "body": "it's been a while since an update! <span class='whisper'>sidenote: i've done about 3 other projects while working lightly on wormboy whoops</span> still working on other exciting and new things, but this update is the debut of my <a href='gallery.html' class='new'>epic art gallery</a>! more will be added as i dick around.",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/821617a2fc3585a0a9838dc8c535a75abbaf8772",
        "id": 11,
        "isMajor": true
    },
    {
        "date": "07/29/2023",
        "title": "auto populating buttons",
        "body": "i have SO MANY FREINDS!!!!! i'm tired to individually updating every page of my site to include all their beautiful buttons. now they autopopulate. i also have some other new things about the buttons on my page.. a little experimental, but we'll see how it goes. i need more other buttons.</p><p class='whisper'>i have been getting really excited about so many projects lately i'm a little scrambled right now but i'm gonna get back into my wormy ways soon enough. worm boy OUT!!!!!!!!",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/1ef4a4040eea555eebc380b6f110367b865025a2",
        "id": 10,
        "isMajor": false
    },
    {
        "date": "07/26/2023",
        "title": "header reorganization",
        "body": "okay!!!!!! i didn't expect another update so quick but here's a small one. now the cursor goes grabby grabby on the windows. working on little buttons in my header. i'm not 100% sure how to describe/define the logic by which i place links in my header area, but i'm kinda liking the vibe. i LOVE my little wormies. love them. also had fun making the forklift animations...</p><p>but THIS isn't my diary!!!!! more coding tips coming soon, i've got some good stuff for beginners because i am realizing it is needed!</p><p>WORMBOYBEDTIME !",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/28723449af1fee472150d8c0a45a581408035b82",
        "id": 9,
        "isMajor": false
    },
    {
        "date": "07/25/2023",
        "title": "scrambled blinkies",
        "body": "minor update, long time coming: now all the blinkies shuffle on my page! i may make it so only 20 are put on the page or whatever... but i dunno :] <span class='whisper'>oh and i got a new ico... more worms to come...</span></p><p>currently, the git is a little... off from the actual live site. this is cuz i'm working on more things with the header and overall interface. and i'm having fun with it, i just... eh. i need to get my shit together when it comes to branches!</p><p>worm boy out!",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/470c9bb8d3548d6fb5ee4a4dcf882d1814d61eaa",
        "id": 8,
        "isMajor": false
    },
    {
        "date":"07/23/2023",
        "title": "header 1.0!",
        "body": "this took me a little longer than expected, <span class='whisper'>but i've been doing some other things too...</span></p><p>but here comes the wormboy header! i am still tweaking and working out the design, so the site will be scrollable for now... bear with me as i figure out how i want things to be placed.</p><p>coming soon: i swear to god accessibility settings, and a new links page layout :]",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/1d5a0bac8b55daf44f23124dd3bdcaa0445a5549",
        "id": 7,
        "isMajor": true
    },
    {
        "date": "07/19/2023",
        "title": "about update",
        "body": "finally updated my about page with some more detail. definitely not its final form, but here we go...</p><p class='whisper'>also, <a href='/tips.html?c=css&a=2'>another new tip</a>, this one's quick. plus some minor edits here and there. worm boy bed time....",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/ef13a2258e405c6d56100f9b775633dbe2a7bfa6",
        "id": 6,
        "isMajor": false
    },
    {
        "date": "07/18/2023",
        "title": "new tutorial!",
        "body": "minor bug fixes around the site's css and ts.</p><p>check out the new article <a href='/tips.html?c=css&a=1'>here!</a>",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/f1734674748a2ead3112c696caa95e8afc54ab15",
        "id": 5,
        "isMajor": false
    },
    {
        "date": "07/15/2023",
        "title": "double click chicken flip",
        "body": "desktop only: double clicking on a free-floating image flips it horizontally. try that <a href='/about.html'>here</a>! this is HUGE.",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/791bee6e1b0035161cbf6af5135c0a2d3e312057",
        "id": 4,
        "isMajor": true
    },
    {
        "date": "07/15/2023",
        "title": "css polish, links",
        "body": "fixed my css for desktop AND mobile. took the time to learn what i was actually doing!</p><p class='whisper'>oh and now this changelog page will automatically open an update based on the hash. [<a href='#0'>try that here.</a>], finally added a couple of links, more to come [<a href='/links.html'>here</a>], and now certain windows will randomly scatter themselves across the page on desktop..... good luck. wormboy away!",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/af469f7f21c9be6d8977e7f8294cf4f2615b780b",
        "id": 3,
        "isMajor": false
    },
    {
        "date": "07/14/2023",
        "title": "beginning tutorial page",
        "body": "just BARELY putting this in on the 14th, but anyways...</p><p>added <a href='tips.html'>a tutorial page</a>. currently labelled 'tips' but i'm not sure if i stick to that. i'm not asking for you to tip me, but 'tutorial' sounds to formal. the idea for this page is for me to document things i learn and have a spot to refer my friends to when they have questions. currently there is but one tutorial up, but the bulk of today's work was <span class='silenced'>getting myself to focus on just one page</span> getting the framework in place. worm boy BED TIME!!!",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/2efdc193683aa2fcec3ef3ac963e24d9865c0717",
        "id": 2,
        "isMajor": false
    },
    {
        "date": "07/14/2023",
        "title": "scream!",
        "body": "to get the boring things out of the way... i did a pretty big restructure to the site's file organization! two actually!! but no one cares about that. let's get to the fun stuff:</p><p><a href='./scream.html' class='new'>yell into the void!</a> i'm not sure when i first had the idea for this page, but it didn't take very long to make it a reality. if anyone is out there, let me know what you think of it. it could use some polish regardless, but i may or may not expand on it in the future.</p><p>more soon to come. wormboy out!!!!!!!",
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/ea7f5365f11a8717533f8200375a5e3eb69bf24e",
        "id": 1,
        "isMajor": true
    },
    {
        "date": "07/12/2023",
        "title": "added changelog!",
        "body": "i have created the beginnings of a changelog! and a full changelog page! if you are reading this, you are probably on that changelog page and hitting buttons. i have future plans for this little window to be able to close, or maaaybe to prevent duplicates from opening.. but that's not really fun :(</p><p>anyways, i have some work to do with how it displays the changelog list, and how it'll highlight major updates! i have soooooo many other things to be doing but for today, this might be wormboy out!.... byebye!!!!!!</p><p>edit: i added more stuff, beginnings for <a href='./about.html'>about</a> and <a href='./links.html'>links</a>. WORM BOY OUT FORREAL NOW!!!!!", 
        "gitCommit": "https://github.com/cryptiddddd/wormboy3/commit/34331a777097488db948f6a4fdb397a4662056e8",
        "id": 0,
        "isMajor": false
    }
]